---
kind: property
id: P:Autodesk.Revit.DB.Electrical.DistributionSysType.ElectricalPhaseConfiguration
source: html/933cb07d-9ca3-0030-c07e-571690365cce.htm
---
# Autodesk.Revit.DB.Electrical.DistributionSysType.ElectricalPhaseConfiguration Property

Get or set electrical phase configuration (Y, delta or undefined) of distribution system.

## Syntax (C#)
```csharp
public ElectricalPhaseConfiguration ElectricalPhaseConfiguration { get; set; }
```